Revit 2027 API
ElectricalSetting.DistributionSysTypes Property
 Get all distribution system types of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DistributionSysTypeSet DistributionSysTypes { get; }
Public ReadOnly Property DistributionSysTypes As DistributionSysTypeSet
	Get
public:
property DistributionSysTypeSet^ DistributionSysTypes {
	DistributionSysTypeSet^ get ();
}
member DistributionSysTypes : DistributionSysTypeSet with get
Property Value
DistributionSysTypeSet
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace